using System.Runtime.CompilerServices;
using System.Net;
using System.Runtime.ConstrainedExecution;
/*
Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.

0, 7, 8, -2, -2 -> 2

-1, -7, 567, 89, 223-> 3
*/

System.Console.WriteLine("Введите числа через пробел: ");

Console.WriteLine($"Text");
int a = int.Parse(Console.ReadLine());
Console.WriteLine(a);

if ( )
{

}
else
{

}
